## Production: database
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                NAME                                |
|--------|--------------------------------------------------------------------|
| update | `aws_rds_cluster_parameter_group.enable_audit_logging`             |
|        | `module.rds_cluster.aws_cloudwatch_log_group.log_exports[&quot;audit&quot;]` |
| add    | `aws_rds_cluster_parameter_group.enable_audit_logging_v8`          |
|        | `aws_security_group_rule.client_vpn_ingress_database`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_rds_cluster_parameter_group.enable_audit_logging will be updated in-place
  ~ resource "aws_rds_cluster_parameter_group" "enable_audit_logging" {
        id          = "wordpress-aurora-mysql57"
        name        = "wordpress-aurora-mysql57"
        tags        = {}
        # (5 unchanged attributes hidden)

      + parameter {
          + apply_method = "pending-reboot"
          + name         = "binlog_format"
          + value        = "ROW"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_rds_cluster_parameter_group.enable_audit_logging_v8 will be created
  + resource "aws_rds_cluster_parameter_group" "enable_audit_logging_v8" {
      + arn         = (known after apply)
      + description = "RDS cluster parameter group with audit logging enabled for MySQL 8.0"
      + family      = "aurora-mysql8.0"
      + id          = (known after apply)
      + name        = "wordpress-aurora-mysql8"
      + name_prefix = (known after apply)
      + tags_all    = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_events"
          + value        = "CONNECT,QUERY_DCL,QUERY_DDL,QUERY_DML"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "server_audit_logging"
          + value        = "1"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "binlog_format"
          + value        = "ROW"
        }
    }

  # aws_security_group_rule.client_vpn_ingress_database will be created
  + resource "aws_security_group_rule" "client_vpn_ingress_database" {
      + description              = "Client VPN ingress to the database"
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-03f4f613cd728faf0"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0d61efb4e9ab60608"
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.rds_cluster.aws_cloudwatch_log_group.log_exports["audit"] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "log_exports" {
        id                = "/aws/rds/cluster/wordpress-cluster/audit"
        name              = "/aws/rds/cluster/wordpress-cluster/audit"
      ~ retention_in_days = 30 -> 7
        tags              = {
            "CostCentre" = "PlatformGCArticles"
            "Name"       = "wordpress-cluster"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_rds_cluster_parameter_group.enable_audit_logging_v8"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_host"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_name"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_password"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.database_username"]

25 tests, 19 passed, 6 warnings, 0 failures, 0 exceptions

```

</details>
